random-benchmark/logs/qwen25-7b-1gpu-result_num_prompt_10_input_len_4096.log
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-7B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=10, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 10/10 [00:26<00:00,  2.65s/it]
============ Serving Benchmark Result ============
Successful requests:                     10        
Benchmark duration (s):                  26.46     
Total input tokens:                      40960     
Total generated tokens:                  5312      
Request throughput (req/s):              0.38      
Output token throughput (tok/s):         200.73    
Total Token throughput (tok/s):          1748.54   
---------------Time to First Token----------------
Mean TTFT (ms):                          6905.57   
Median TTFT (ms):                        7135.79   
P99 TTFT (ms):                           10932.97  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          36.98     
Median TPOT (ms):                        35.79     
P99 TPOT (ms):                           48.66     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.70     
Median ITL (ms):                         30.42     
P99 ITL (ms):                            60.37     
==================================================