random-benchmark/logs/qwen25-7b-1gpu-result_num_prompt_12_input_len_4096.log
/usr/local/lib/python3.11/dist-packages/torchvision/io/image.py:13: UserWarning: Failed to load image Python extension: 'libpng16.so.16: cannot open shared object file: No such file or directory'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, model='/llm/models/Qwen2.5-7B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=12, logprobs=None, request_rate=inf, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
100%|██████████| 12/12 [00:29<00:00,  2.47s/it]
============ Serving Benchmark Result ============
Successful requests:                     12        
Benchmark duration (s):                  29.70     
Total input tokens:                      49152     
Total generated tokens:                  6389      
Request throughput (req/s):              0.40      
Output token throughput (tok/s):         215.12    
Total Token throughput (tok/s):          1870.12   
---------------Time to First Token----------------
Mean TTFT (ms):                          8067.12   
Median TTFT (ms):                        8132.68   
P99 TTFT (ms):                           13028.30  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          40.65     
Median TPOT (ms):                        39.62     
P99 TPOT (ms):                           49.47     
---------------Inter-token Latency----------------
Mean ITL (ms):                           43.19     
Median ITL (ms):                         32.44     
P99 ITL (ms):                            65.50     
==================================================